# Module: Pandas Assignments
## Lesson: Pandas
### Assignment 1: DataFrame Creation and Indexing

1. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Set the index to be the first column.

In [1]:
import pandas as pd
import numpy as np

df=pd.DataFrame(np.random.randint(1,100,
size=(6,4)
),columns=['A','B','C','D'])
df.set_index('A')

     B   C   D
A
37  69  29  25
61  26  89  38
16  74  52  48
88  97  87  27
28   3  42  60
60  47  78  25

2. Create a Pandas DataFrame with columns 'A', 'B', 'C' and index 'X', 'Y', 'Z'. Fill the DataFrame with random integers and access the element at row 'Y' and column 'B'.

In [2]:
df=pd.DataFrame(np.random.randint(1,100,
size=(3,3)
),columns=['A','B','C'],index=['X','Y','Z'])
print(df.iloc[1,1])
'''df.iloc[1,1]
df.loc['Y']
df.loc['Y','B']'''

55

"df.iloc[1,1]\ndf.loc['Y']\ndf.loc['Y','B']"

### Assignment 2: DataFrame Operations

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Add a new column that is the product of the first two columns.

In [3]:
df = pd.DataFrame(np.random.randint(1, 51, size=(5, 3)), columns=['X', 'Y', 'Z'])
df['Mul']=df['X']*df['Y']
df

    X   Y   Z   Mul
0  36  44  48  1584
1  33  23  16   759
2  29  25  29   725
3  19  20  45   380
4   1  42  24    42

2. Create a Pandas DataFrame with 3 columns and 4 rows filled with random integers. Compute the row-wise and column-wise sum.

In [4]:

row_sum=df.sum(axis=1)
print('\nrow wise sum',row_sum)

col_sum=df.sum(axis=0)
print('Col wise sum: ',col_sum)
df

row wise sum 0    1712
1     831
2     808
3     464
4     109
dtype: int64
Col wise sum:  X       118
Y       154
Z       162
Mul    3490
dtype: int64

    X   Y   Z   Mul
0  36  44  48  1584
1  33  23  16   759
2  29  25  29   725
3  19  20  45   380
4   1  42  24    42

### Assignment 3: Data Cleaning

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Introduce some NaN values. Fill the NaN values with the mean of the respective columns.

In [5]:
df = pd.DataFrame(np.random.randint(1, 101, size=(5, 3)), columns=['A', 'B', 'C'])
df.iloc[1, 0] = np.nan  # set A[1] to NaN
df.iloc[3, 2] = np.nan  # set C[3] to NaN

df

      A   B     C
0   5.0  81  99.0
1   NaN  59  60.0
2  80.0  31   1.0
3  55.0  18   NaN
4   7.0  78  87.0

In [6]:
df.isnull().sum()

A    1
B    0
C    1
dtype: int64

In [7]:
df['A']=df['A'].fillna(df['A'].mean())
df

       A   B     C
0   5.00  81  99.0
1  36.75  59  60.0
2  80.00  31   1.0
3  55.00  18   NaN
4   7.00  78  87.0

In [8]:
df['C']=df['C'].fillna(df['C'].mean())
df

       A   B      C
0   5.00  81  99.00
1  36.75  59  60.00
2  80.00  31   1.00
3  55.00  18  61.75
4   7.00  78  87.00

2. Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers. Introduce some NaN values. Drop the rows with any NaN values.

In [12]:
# Create a Pandas DataFrame with 4 columns and 6 rows filled with random integers
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 4)), columns=['A', 'B', 'C', 'D'])
print("Original DataFrame:")
print(df)

# Introduce some NaN values
df.iloc[1, 2] = np.nan
df.iloc[3, 0] = np.nan
df.iloc[5, 1] = np.nan
print("DataFrame with NaN values:")
print(df)

# Drop the rows with any NaN values
df.dropna(inplace=True)
print("DataFrame with NaN values dropped:")
print(df)

Original DataFrame:
    A   B   C   D
0  31  34   4  34
1  43  93  57  39
2   9   3  38  99
3  51  19  61  70
4  68  54  99  90
5  11  62  36  38
DataFrame with NaN values:
      A     B     C   D
0  31.0  34.0   4.0  34
1  43.0  93.0   NaN  39
2   9.0   3.0  38.0  99
3   NaN  19.0  61.0  70
4  68.0  54.0  99.0  90
5  11.0   NaN  36.0  38
DataFrame with NaN values dropped:
      A     B     C   D
0  31.0  34.0   4.0  34
2   9.0   3.0  38.0  99
4  68.0  54.0  99.0  90

### Assignment 4: Data Aggregation

1. Create a Pandas DataFrame with 2 columns: 'Category' and 'Value'. Fill the 'Category' column with random categories ('A', 'B', 'C') and the 'Value' column with random integers. Group the DataFrame by 'Category' and compute the sum and mean of 'Value' for each category.

In [21]:
df = pd.DataFrame({'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Value': np.random.randint(1, 100, size=10)})
print("Original DataFrame:")
print(df)

grouped=df.groupby('Category')['Value'].agg(['sum','mean'])
print("Grouped DataFrame:")
print(grouped.round(2))

Original DataFrame:
  Category  Value
0        C      7
1        B     71
2        C     66
3        B     72
4        B     14
5        C     92
6        B     28
7        B     81
8        A     81
9        A     64
Grouped DataFrame:
          sum  mean
Category
A         145  72.5
B         266  53.2
C         165  55.0

2. Create a Pandas DataFrame with 3 columns: 'Product', 'Category', and 'Sales'. Fill the DataFrame with random data. Group the DataFrame by 'Category' and compute the total sales for each category.

In [38]:
df = pd.DataFrame({'Product': np.random.choice(['Prod1', 'Prod2', 'Prod3'], size=10), 'Category': np.random.choice(['A', 'B', 'C'], size=10), 'Sales': np.random.randint(1, 100, size=10)})
print("Original DataFrame:")
print(df)

grouped_pd=df.groupby('Category')['Sales'].sum()
print('grouped dataframe : ')
print(grouped_pd)

Original DataFrame:
  Product Category  Sales
0   Prod3        A     15
1   Prod2        A     29
2   Prod1        B      3
3   Prod3        A     34
4   Prod1        A     69
5   Prod1        B     46
6   Prod3        B      6
7   Prod1        C     17
8   Prod2        C      2
9   Prod3        C     36
grouped dataframe :
Category
A    147
B     55
C     55
Name: Sales, dtype: int32

### Assignment 5: Merging DataFrames

1. Create two Pandas DataFrames with a common column. Merge the DataFrames using the common column.

In [40]:
df1 = pd.DataFrame({'Key': ['A', 'B', 'C', 'D'], 'Value1': np.random.randint(1, 100, size=4)})
df2 = pd.DataFrame({'Key': ['A', 'B', 'C', 'E'], 'Value2': np.random.randint(1, 100, size=4)})
print("DataFrame 1:")
print(df1)
print("DataFrame 2:")
print(df2)

merged_df=pd.merge(df1,df2)
print("Merged DataFrame:")
print(merged_df)

DataFrame 1:
  Key  Value1
0   A      87
1   B      87
2   C      46
3   D      69
DataFrame 2:
  Key  Value2
0   A      70
1   B       8
2   C      25
3   E      79
Merged DataFrame:
  Key  Value1  Value2
0   A      87      70
1   B      87       8
2   C      46      25

2. Create two Pandas DataFrames with different columns. Concatenate the DataFrames along the rows and along the columns.

In [47]:
df1 = pd.DataFrame({'A': np.random.randint(1, 100, size=3), 'B': np.random.randint(1, 100, size=3)})
df2 = pd.DataFrame({'C': np.random.randint(1, 100, size=3), 'D': np.random.randint(1, 100, size=3)})
print("DataFrame 1:")
print(df1)
print("DataFrame 2:")
print(df2)

concat_rows=pd.concat([df1,df2],axis=0)
print("Concatenated DataFrame (rows):")
print(concat_rows)


concat_columns = pd.concat([df1, df2], axis=1)
print("Concatenated DataFrame (columns):")
print(concat_columns)


concat_rows.isnull().sum()

mean=concat_rows.mean()
concat_rows.fillna(mean,inplace=True)
print("DataFrame with NaN values filled:")
print(concat_rows.round(2))

DataFrame 1:
    A   B
0  66  60
1  31  47
2   7  54
DataFrame 2:
    C   D
0  54  67
1  62  53
2  64  93
Concatenated DataFrame (rows):
      A     B     C     D
0  66.0  60.0   NaN   NaN
1  31.0  47.0   NaN   NaN
2   7.0  54.0   NaN   NaN
0   NaN   NaN  54.0  67.0
1   NaN   NaN  62.0  53.0
2   NaN   NaN  64.0  93.0
Concatenated DataFrame (columns):
    A   B   C   D
0  66  60  54  67
1  31  47  62  53
2   7  54  64  93
DataFrame with NaN values filled:
       A      B     C     D
0  66.00  60.00  60.0  71.0
1  31.00  47.00  60.0  71.0
2   7.00  54.00  60.0  71.0
0  34.67  53.67  54.0  67.0
1  34.67  53.67  62.0  53.0
2  34.67  53.67  64.0  93.0

### Assignment 6: Time Series Analysis

1. Create a Pandas DataFrame with a datetime index and one column filled with random integers. Resample the DataFrame to compute the monthly mean of the values.

In [49]:
date_rng = pd.date_range(start='2022-01-01', end='2022-12-31', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = np.random.randint(0, 100, size=(len(date_rng)))
df.set_index('date', inplace=True)
print("Original DataFrame:")
print(df)

monthly_mean=df.resample('M').mean()
print("Monthly mean DataFrame:")
print(monthly_mean)

Original DataFrame:
            data
date
2022-01-01    21
2022-01-02    69
2022-01-03    51
2022-01-04    46
2022-01-05    17
...          ...
2022-12-27    64
2022-12-28    20
2022-12-29    52
2022-12-30    37
2022-12-31    31

[365 rows x 1 columns]
Monthly mean DataFrame:
                 data
date
2022-01-31  46.806452
2022-02-28  54.642857
2022-03-31  52.580645
2022-04-30  49.733333
2022-05-31  48.419355
2022-06-30  47.000000
2022-07-31  41.064516
2022-08-31  49.516129
2022-09-30  46.233333
2022-10-31  51.806452
2022-11-30  43.133333
2022-12-31  40.838710

C:\Users\Tanvir\AppData\Local\Temp\ipykernel_20488\1109848877.py:8: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  monthly_mean=df.resample('M').mean()

2. Create a Pandas DataFrame with a datetime index ranging from '2021-01-01' to '2021-12-31' and one column filled with random integers. Compute the rolling mean with a window of 7 days.

In [51]:
date_rng = pd.date_range(start='2021-01-01', end='2021-12-31', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = np.random.randint(0, 100, size=(len(date_rng)))
df.set_index('date', inplace=True)
print("Original DataFrame:")
print(df)

rolling_mean = df.rolling(window=7).mean()
print("Rolling mean DataFrame:")
print(rolling_mean)

Original DataFrame:
            data
date
2021-01-01    10
2021-01-02    76
2021-01-03    11
2021-01-04    14
2021-01-05    21
...          ...
2021-12-27    93
2021-12-28    67
2021-12-29    35
2021-12-30    99
2021-12-31    25

[365 rows x 1 columns]
Rolling mean DataFrame:
                 data
date
2021-01-01        NaN
2021-01-02        NaN
2021-01-03        NaN
2021-01-04        NaN
2021-01-05        NaN
...               ...
2021-12-27  45.428571
2021-12-28  42.428571
2021-12-29  46.428571
2021-12-30  54.285714
2021-12-31  56.142857

[365 rows x 1 columns]

### Assignment 7: MultiIndex DataFrame

1. Create a Pandas DataFrame with a MultiIndex (hierarchical index). Perform some basic indexing and slicing operations on the MultiIndex DataFrame.

In [59]:
arrays = [['A', 'A', 'B', 'B'], ['one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'SubCategory'))
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 3)), index=index, columns=['Value1', 'Value2', 'Value3'])
print("MultiIndex DataFrame:")
print(df)

print("Indexing at Category 'A':")
print(df.loc['A'])

print("Slicing at Category 'B' and SubCategory 'two':")
print(df.loc[('B', 'two')])

MultiIndex DataFrame:
                      Value1  Value2  Value3
Category SubCategory
A        one              86      82      68
         two              66      22       4
B        one              89      88      88
         two              26      46      77
Indexing at Category 'A':
             Value1  Value2  Value3
SubCategory
one              86      82      68
two              66      22       4
Slicing at Category 'B' and SubCategory 'two':
Value1    26
Value2    46
Value3    77
Name: (B, two), dtype: int32

2. Create a Pandas DataFrame with MultiIndex consisting of 'Category' and 'SubCategory'. Fill the DataFrame with random data and compute the sum of values for each 'Category' and 'SubCategory'.

In [61]:
arrays = [['A', 'A', 'B', 'B', 'C', 'C'], ['one', 'two', 'one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=('Category', 'SubCategory'))
df = pd.DataFrame(np.random.randint(1, 100, size=(6, 3)), index=index, columns=['Value1', 'Value2', 'Value3'])
print("MultiIndex DataFrame:")
print(df)

sum_values=df.groupby(['Category','SubCategory']).sum()
print('Sum of the groups: ',sum_values)

MultiIndex DataFrame:
                      Value1  Value2  Value3
Category SubCategory
A        one              34      50      94
         two              72      44      58
B        one               5      93      16
         two              35      53      86
C        one              55      84      41
         two               6      59      80
Sum of the groups:                        Value1  Value2  Value3
Category SubCategory
A        one              34      50      94
         two              72      44      58
B        one               5      93      16
         two              35      53      86
C        one              55      84      41
         two               6      59      80

### Assignment 8: Pivot Tables

1. Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'. Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'.

In [62]:
# Create a Pandas DataFrame with columns 'Date', 'Category', and 'Value'
date_rng = pd.date_range(start='2022-01-01', end='2022-01-10', freq='D')
df = pd.DataFrame({'Date': np.random.choice(date_rng, size=20), 'Category': np.random.choice(['A', 'B', 'C'], size=20), 'Value': np.random.randint(1, 100, size=20)})
print("Original DataFrame:")
print(df)

# Create a pivot table to compute the sum of 'Value' for each 'Category' by 'Date'
pivot_table = df.pivot_table(values='Value', index='Date', columns='Category', aggfunc='sum')
print("Pivot Table:")
print(pivot_table)

Original DataFrame:
         Date Category  Value
0  2022-01-03        B     17
1  2022-01-04        C     86
2  2022-01-01        A     98
3  2022-01-05        A     90
4  2022-01-03        C     92
5  2022-01-05        A     51
6  2022-01-04        B     87
7  2022-01-01        C     79
8  2022-01-05        A      7
9  2022-01-01        A     81
10 2022-01-03        A     27
11 2022-01-10        A     90
12 2022-01-04        B     64
13 2022-01-01        A     50
14 2022-01-07        C      1
15 2022-01-02        B     46
16 2022-01-08        C     13
17 2022-01-07        C     81
18 2022-01-06        A     34
19 2022-01-07        C     47
Pivot Table:
Category        A      B      C
Date
2022-01-01  229.0    NaN   79.0
2022-01-02    NaN   46.0    NaN
2022-01-03   27.0   17.0   92.0
2022-01-04    NaN  151.0   86.0
2022-01-05  148.0    NaN    NaN
2022-01-06   34.0    NaN    NaN
2022-01-07    NaN    NaN  129.0
2022-01-08    NaN    NaN   13.0
2022-01-10   90.0    NaN    NaN

2. Create a Pandas DataFrame with columns 'Year', 'Quarter', and 'Revenue'. Create a pivot table to compute the mean 'Revenue' for each 'Quarter' by 'Year'.

In [66]:
df = pd.DataFrame({'Year': np.random.choice([2020, 2021, 2022], size=12), 'Quarter': np.random.choice(['Q1', 'Q2', 'Q3', 'Q4'], size=12), 'Revenue': np.random.randint(1, 1000, size=12)})
print("Original DataFrame:")
print(df)

pivot_table=df.pivot_table(values='Revenue', index='Year', columns='Quarter', aggfunc='mean')
print("Pivot Table:")
print(pivot_table)
mean=pivot_table.mean()
pivot_table.fillna(mean,inplace=True)
print('Fill Pivot Table using its mean..')
print(pivot_table)

Original DataFrame:
    Year Quarter  Revenue
0   2020      Q2      115
1   2020      Q4      408
2   2022      Q1       42
3   2020      Q2      354
4   2022      Q2      248
5   2022      Q1      356
6   2022      Q3      891
7   2021      Q1      414
8   2022      Q4       98
9   2021      Q3      388
10  2021      Q1      542
11  2021      Q1      346
Pivot Table:
Quarter     Q1     Q2     Q3     Q4
Year
2020       NaN  234.5    NaN  408.0
2021     434.0    NaN  388.0    NaN
2022     199.0  248.0  891.0   98.0
Fill Pivot Table using its mean..
Quarter     Q1      Q2     Q3     Q4
Year
2020     316.5  234.50  639.5  408.0
2021     434.0  241.25  388.0  253.0
2022     199.0  248.00  891.0   98.0

### Assignment 9: Applying Functions

1. Create a Pandas DataFrame with 3 columns and 5 rows filled with random integers. Apply a function that doubles the values of the DataFrame.

In [68]:
df=pd.DataFrame(np.random.randint(1,100,size=(5,3)),columns=['A', 'B', 'C'])
print(df)

df_doubled=df.applymap(lambda x:x*2)
print(df_doubled)

    A   B   C
0  19  84  69
1  75  19  82
2  98  79  19
3  84  82  20
4  36  20  69
     A    B    C
0   38  168  138
1  150   38  164
2  196  158   38
3  168  164   40
4   72   40  138

C:\Users\Tanvir\AppData\Local\Temp\ipykernel_20488\1767315580.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_doubled=df.applymap(lambda x:x*2)

In [71]:
df=pd.DataFrame(np.random.randint(1,100,size=(6,3)),columns=['A', 'B', 'C'])
print(df)

df['Sum']=df.apply(lambda row:row.sum(),axis=1)
print("DataFrame with Sum column:")
print(df)

    A   B   C
0  36  43  69
1   5  17  37
2  31  40  94
3  40  26  29
4  91  95   3
5  78  79  55
DataFrame with Sum column:
    A   B   C  Sum
0  36  43  69  148
1   5  17  37   59
2  31  40  94  165
3  40  26  29   95
4  91  95   3  189
5  78  79  55  212

### Assignment 10: Working with Text Data

1. Create a Pandas Series with 5 random text strings. Convert all the strings to uppercase.

In [73]:
text_data = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
print("Original Series:")
print(text_data)

up_data=text_data.str.upper()
print(up_data)

Original Series:
0         apple
1        banana
2        cherry
3          date
4    elderberry
dtype: object
0         APPLE
1        BANANA
2        CHERRY
3          DATE
4    ELDERBERRY
dtype: object

2. Create a Pandas Series with 5 random text strings. Extract the first three characters of each string.

In [78]:
text_data = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
print("Original Series:")
print(text_data)

f3_char=text_data.str[:3]
print(f3_char)

l3_char=text_data.str[-3:]
print(l3_char)

last_char=text_data.str[-1:]
print(last_char)

Original Series:
0         apple
1        banana
2        cherry
3          date
4    elderberry
dtype: object
0    app
1    ban
2    che
3    dat
4    eld
dtype: object
0    ple
1    ana
2    rry
3    ate
4    rry
dtype: object
0    e
1    a
2    y
3    e
4    y
dtype: object